nxp-mcuxpresso/mcux-soc-svd/MCXN527/MCXN527_cm33_core0.xml
        <register>
          <name>EDIER</name>
          <description>EFT Detect Interrupt Enable</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDIE0</name>
              <description>EFT Detect Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Interrupt not generated upon detection of the EFT event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Interrupt generated upon detection of the EFT event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDIE1</name>
              <description>EFT Detect Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Interrupt not generated upon detection of the EFT event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Interrupt generated upon detection of the EFT event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDIE2</name>
              <description>EFT Detect Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Interrupt not generated upon detection of the EFT event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Interrupt generated upon detection of the EFT event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDIE3</name>
              <description>EFT Detect Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Interrupt not generated upon detection of the EFT event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Interrupt generated upon detection of the EFT event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDIE4</name>
              <description>EFT Detect Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Interrupt not generated upon detection of the EFT event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Interrupt generated upon detection of the EFT event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDIE5</name>
              <description>EFT Detect Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Interrupt not generated upon detection of the EFT event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Interrupt generated upon detection of the EFT event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDIE6</name>
              <description>EFT Detect Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Interrupt not generated upon detection of the EFT event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Interrupt generated upon detection of the EFT event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDIE7</name>
              <description>EFT Detect Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Interrupt not generated upon detection of the EFT event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Interrupt generated upon detection of the EFT event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDIE12</name>
              <description>EFT Detect Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Interrupt not generated upon detection of the EFT event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Interrupt generated upon detection of the EFT event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDIE13</name>
              <description>EFT Detect Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Interrupt not generated upon detection of the EFT event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Interrupt generated upon detection of the EFT event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDIE14</name>
              <description>EFT Detect Interrupt Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Interrupt not generated upon detection of the EFT event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Interrupt generated upon detection of the EFT event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDIE15</name>
              <description>EFT Detect Interrupt Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Interrupt not generated upon detection of the EFT event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Interrupt generated upon detection of the EFT event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDIE16</name>
              <description>EFT Detect Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Interrupt not generated upon detection of the EFT event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Interrupt generated upon detection of the EFT event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDIE17</name>
              <description>EFT Detect Interrupt Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Interrupt not generated upon detection of the EFT event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Interrupt generated upon detection of the EFT event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDIE18</name>
              <description>EFT Detect Interrupt Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Interrupt not generated upon detection of the EFT event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Interrupt generated upon detection of the EFT event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDIE19</name>
              <description>EFT Detect Interrupt Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Interrupt not generated upon detection of the EFT event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Interrupt generated upon detection of the EFT event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDIE20</name>
              <description>EFT Detect Interrupt Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Interrupt not generated upon detection of the EFT event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Interrupt generated upon detection of the EFT event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDIE21</name>
              <description>EFT Detect Interrupt Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Interrupt not generated upon detection of the EFT event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Interrupt generated upon detection of the EFT event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDIE22</name>
              <description>EFT Detect Interrupt Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Interrupt not generated upon detection of the EFT event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Interrupt generated upon detection of the EFT event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDIE23</name>
              <description>EFT Detect Interrupt Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Interrupt not generated upon detection of the EFT event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Interrupt generated upon detection of the EFT event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EDCR</name>
          <description>EFT Detect Clear</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDHC</name>
              <description>EFT Detect High Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edhc0</name>
                  <description>Does not clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edhc1</name>
                  <description>Clears</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDLC</name>
              <description>EFT Detect Low Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edlc0</name>
                  <description>Does not clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edlc1</name>
                  <description>Clears</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
